// 배열의 메서드 활용 JS


// 0. 기본정보 셋팅 //////////////////
 // (1) 배열변수 선언과 할당
 const fruit = ["배", "사과", "용과", "딸기"];

 // (2) 과일명과 배경이미지명을 매칭함 -> 객체
 const frObj = {
     배: "fruits_01",
     사과: "fruits_02",
     용과: "fruits_14",
     딸기: "fruits_09",
     두리안: "fruits_17",
     바나나: "fruits_15",
     수박: "fruits_12",
     파인애플: "fruits_13",
     망고: "fruits_24",
     오렌지: "fruits_03",
     체리: "fruits_05",
     멜론: "fruits_11",
     블루베리: "fruits_20",
     레몬: "fruits_04",
     산딸기: "fruits_25",
 }; ////////// frObj 객체 /////


// 1. 요구사항 : 배열에 과일정보를 담아서 '과일주세요'버튼 클릭시
// 과일 이미지요소를 화면에 출력해준다!
// 배열구성을 수정, 삭제 등 배열 메서드로 변경할 수 있게 한다!

// 2. 대상선정 : 
// 2-1. 이벤트 대상 : .mbtn (기능버튼들)
// 2-2. 변경 대상 : .showit (배열정보출력) / .cont (과일출력박스)
// 2-3. 전체과일콤보박스 : #sel
// 2-4. 선택과일콤보박스(anum=array number) : #anum
// 2-5. 지울개수입력창 : #delnum